fabrika/src/Documents/ПриходМашины/ПриходМашины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходМашины</name>
  <basedOn>Document.ЗаявкаНаМашину</basedOn>
  <registerRecords>AccumulationRegister.ТаможняОплатаГТД</registerRecords>
  <registerRecords>AccumulationRegister.ТаможняВзаимозадолженности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМашины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПлатёж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаМашину</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЗвена</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <comment>Тип содержимого машины</comment>
    <type>
      <types>EnumRef.ТипМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнвойса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РаспределениеПоПокупателям</name>
    <comment>Распределение машины по покупателям</comment>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <comment>Договор контрагента</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговляНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПеремещения</name>
      <comment>Дата перемещения</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодИнвойсы</name>
    <comment>Под инвойсы</comment>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fabrika/src/InformationRegisters/НаценкиНаТовар/НаценкиНаТовар.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаценкиНаТовар</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрагентЗвена</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипМашины</name>
    <comment>Тип содержимого машины</comment>
    <type>
      <types>EnumRef.ТипМашины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/AccumulationRegisters/ТаможняВзаимозадолженности/ТаможняВзаимозадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТаможняВзаимозадолженности</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fabrika/src/AccumulationRegisters/ТаможняОплатаГТД/ТаможняОплатаГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТаможняОплатаГТД</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ПриходМашины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодИнвойсНомер</name>
    <comment>ПодИнвойс номер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fabrika/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>Вид договора</comment>
    <type>
      <types>EnumRef.ВидДоговораКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

fabrika/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Глоссаб</name>
      <description>Глоссаб</description>
    </items>
    <items>
      <name>Таможни</name>
      <description>Таможни</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТорговле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютныйРассчёт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <comment>ДополнительныеРеквизиты </comment>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <comment>ТекстоваяСтрока</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fabrika/src/Documents/ПриходМашины/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаМашину") Тогда
		// Заполнение шапки
		ВалютнаяСтоимость = ДанныеЗаполнения.ВалютнаяСтоимость;
		НомерГТД = ДанныеЗаполнения.НомерГТД;
		НомерМашины = ДанныеЗаполнения.НомерМашины;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения;
		ТипМашины = ДанныеЗаполнения.ТипМашины;
		ВидМашины = ДанныеЗаполнения.ВидМашины;
		//ОпределениеКонтрагентовИНаценки();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидМашины"));
	
	Если РаспределениеПоПокупателям.Количество() > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("РаспределениеПоПокупателям.Покупатель");
		ПроверяемыеРеквизиты.Добавить("РаспределениеПоПокупателям.Сумма");
	КонецЕсли;	

КонецПроцедуры


////Дима 28.07.2014 11:24:31////Определение покупателя и наценки
Процедура ОпределениеКонтрагентовИНаценки() экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаценкиНаТоварСрезПоследних.Поставщик,
	|	НаценкиНаТоварСрезПоследних.Покупатель,
	|	НаценкиНаТоварСрезПоследних.Наценка,
	|	НаценкиНаТоварСрезПоследних.КонтрагентЗвена
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.НаценкиНаТовар.СрезПоследних(
	|			&ДатаСреза,
	|			Организация = &Организация
	|				И ТипМашины = &ТипМашины) КАК НаценкиНаТоварСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ.Покупатель КАК Покупатель,
	|	ТаможняВзаимозадолженностиОбороты.СуммаДолгаПриход КАК СуммаДолгаОборот,
	|	ВТ.Поставщик,
	|	ВТ.Наценка,
	|	ВТ.КонтрагентЗвена
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТаможняВзаимозадолженности.Обороты(
	|				&НачалоМесяца,
	|				&ДатаСреза,
	|				Период,
	|				Организация = &Организация
	|					И Контрагент В
	|						(ВЫБРАТЬ
	|							ВТ.Покупатель
	|						ИЗ
	|							ВТ КАК ВТ
	|						СГРУППИРОВАТЬ ПО
	|							ВТ.Покупатель)) КАК ТаможняВзаимозадолженностиОбороты
	|		ПО ВТ.Покупатель = ТаможняВзаимозадолженностиОбороты.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Покупатель,
	|	СуммаДолгаОборот";
	
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаСреза", ПолучитьГраницуПериода());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипМашины", ТипМашины);
			
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Поставщик = Результат[0].Поставщик; 
		Покупатель = Результат[0].Покупатель;
		Наценка = Результат[0].Наценка;
		КонтрагентЗвена = Результат[0].КонтрагентЗвена;
	КонецЕсли;
	
	
КонецПроцедуры

////Дима 17.07.2018 9:46:32////Определение договора "по умолчанию"
Процедура ЗаполнитьДоговорПоУмолчанию() Экспорт

  Запрос = Новый Запрос;
  Запрос.Текст = "ВЫБРАТЬ
                 |	ДоговорыКонтрагентов.Ссылка КАК Договор
                 |ИЗ
                 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
                 |ГДЕ
                 |	ДоговорыКонтрагентов.Организация = &Организация
                 |	И ДоговорыКонтрагентов.ПоУмолчанию = ИСТИНА
                 |	И ДоговорыКонтрагентов.Владелец = &Владелец";
  
  Запрос.УстановитьПараметр("Организация", Организация);
  Запрос.УстановитьПараметр("Владелец", Поставщик);
  
  ДоговорВыборка = Запрос.Выполнить().Выбрать();
  Если ДоговорВыборка.Следующий() Тогда
	  ДоговорыКонтрагентов = ДоговорВыборка.Договор;
  КонецЕсли;	  
  

КонецПроцедуры
//конец Дима

Функция ПолучитьГраницуПериода() экспорт
	
	////Дима 12.08.2014 18:04:58////Убрал получение границы по контрагенту
	МассивПараметров = Новый Массив;
	//МассивПараметров.Добавить("Контрагент");
	МассивПараметров.Добавить("МоментВремени");
	
	ЗаписиРегистра = ОбщийМодульСервер.ПолучениеЗаписейРегистраПоРегистратору("ТаможняВзаимозадолженности", Ссылка, МассивПараметров);
	
	//Для каждого Запись Из ЗаписиРегистра Цикл
	//	Если Запись.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Покупатели") Тогда
	//		Граница = Новый Граница(Запись.МоментВремени, ВидГраницы.Исключая);			
	//	КонецЕсли;	
	//КонецЦикла;
	
	Если ЗаписиРегистра.Количество() > 0 Тогда 
		Граница = Новый Граница(ЗаписиРегистра[0].МоментВремени, ВидГраницы.Исключая);
		возврат Граница;
	Иначе
		возврат Дата;
	КонецЕсли;	
		
	
КонецФункции



//////////////////////////////////////ОБРАБОТКИ ПРОВЕДЕНИЯ//////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ОбработкаПроведения(Отказ, Режим)
	
  ПроведениеПоРегиструТаможняВзаимозадолженности();
  
  ПроведениеПоРегиструТаможняОплатаГТД();
	
КонецПроцедуры

Процедура ПроведениеПоРегиструТаможняВзаимозадолженности()

	// регистр ТаможняВзаимозадолженности Приход
	
	//Движение по поставщику
	Движения.ТаможняВзаимозадолженности.Записывать = Истина;
	Движение = Движения.ТаможняВзаимозадолженности.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Поставщик;
	Движение.ДоговорыКонтрагентов = ДоговорыКонтрагентов;
	Движение.ВалютнаяСуммаДолга = ВалютнаяСтоимость;
	Движение.ТипДвижения = "Поступление от иностранного поставщика";
	
	
	//Движение по покупателю
	Если РаспределениеПоПокупателям.Количество() > 0  Тогда
		Для Каждого строка из РаспределениеПоПокупателям Цикл
			Движение = Движения.ТаможняВзаимозадолженности.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ?(строка.ДатаПеремещения = Дата(1,1,1), Дата, строка.ДатаПеремещения);
			Движение.Организация = строка.Организация;
			Движение.Контрагент = строка.Покупатель;
			Движение.ДоговорыКонтрагентов = строка.Договор;
			Движение.СуммаДолга = строка.Сумма;
			Движение.ТипДвижения = "Продажа покупателю в России";
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(Покупатель) И СуммаДолга > 0 Тогда
		Движение = Движения.ТаможняВзаимозадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Покупатель;
		Движение.СуммаДолга = СуммаДолга;
		Движение.ТипДвижения = "Продажа покупателю в России";
	КонецЕсли;		
	

	//Движение по контрагенту звена
	Если КонтрагентЗвена <> Справочники.Контрагенты.ПустаяСсылка() Тогда
		Движение = Движения.ТаможняВзаимозадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", Покупатель.ИНН);
		Движение.Контрагент = КонтрагентЗвена;
		Движение.СуммаДолга = СуммаДолга;
		Движение.ТипДвижения = "Продажа контрагенту звена";
	КонецЕсли;
	

КонецПроцедуры

Процедура ПроведениеПоРегиструТаможняОплатаГТД()

	//регистр ТаможняОплатаГТД
	Движения.ТаможняОплатаГТД.Записывать = Истина;
	
	
	////Дима 31.08.2016 10:49:57////Датой проведения сделаем дату прихода машины на склад
	ПериодЗагрузки = ?(ДокументОснование.ДатаПрихода <> Дата(1, 1, 1), ДокументОснование.ДатаПрихода, Дата);
	//конец Дима
	
	
	Если ПодИнвойсы.Количество() > 0 Тогда
		Для Каждого Строка Из ПодИнвойсы Цикл
			Движение = Движения.ТаможняОплатаГТД.Добавить();
			Движение.Период = ПериодЗагрузки;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ГТД = Ссылка;
			Движение.ПодИнвойсНомер = Строка.НомерСтроки;
			Движение.ТипДвижения = "Приход машин";
			Движение.Сумма = Строка.Сумма;
		КонецЦикла;	
	Иначе
		Движение = Движения.ТаможняОплатаГТД.Добавить();
		Движение.Период = ПериодЗагрузки;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ГТД = Ссылка;
		Движение.ТипДвижения = "Приход машин";
		Движение.Сумма = ВалютнаяСтоимость;
	КонецЕсли;	

	
		
	
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////




////Дима 15.08.2014 16:08:51////Рассчитать итоговую сумму долга
Процедура РассчитатьИтоговуюСумму() Экспорт 
	
	СуммаДолга = (ВалютнаяСтоимость * КурсГТД + ТаможенныйПлатёж) * (100 + Наценка)/100;
	
КонецПроцедуры
